tap "alajmo/mani" # For mani
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "asdf"
brew "atuin"
brew "bash"
brew "bat"
brew "curl"
brew "entr"
brew "eza"
brew "fastgron"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libpq"
brew "mackup"
brew "mas" # mas-cli, to install from the App Store
brew "midnight-commander"
brew "ncdu"
brew "psgrep"
brew "ripgrep"
brew "starship"
brew "steampipe"
brew "stow"
brew "tig"
brew "tmux"
brew "watch"
brew "xsv"
brew "yamllint"
brew "zsh"

brew "alajmo/mani/mani"

# cask "1password"
# cask "1password7"
cask "alfred"
cask "beyond-compare"
cask "dropbox"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "mullvadvpn"
# cask "nordvpn"
cask "orion"
cask "setapp"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

brew "mas" # mas-cli, to install from the App Store
mas "Little Snitch Mini", id: 1629008763
mas "Things 3", id: 904280696
