brew "zsh"
brew "bash"
brew "zsh-completions"
brew "zsh-lovers"

brew "fzf"
brew "git"
brew "tig"
brew "diff-so-fancy"

brew "ripgrep"
brew "ack"
brew "the_platinum_searcher"
brew "the_silver_searcher"

brew "rbenv"
brew "ruby-build"
brew "tmux"
brew "python"
brew "python3"

brew "vim"

brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "elasticsearch", restart_service: true
brew "mysql", restart_service: true

brew "ansible"
brew "awscli"
brew "chromedriver"
brew "pgcli"
brew "psql2csv"

# Misc utils
brew "tree"
brew "htop"
# brew "htop-osx"
brew "ascii"
brew "cloc"
brew "curl"
brew "httpie"
brew "simon-engledew/gocmdpev/gocmdpev"
brew "pwgen"
brew "p7zip"
brew "mitmproxy"
brew "jq"
brew "xsv"

# Personal
brew "youtube-dl"
brew "hledger"

# Not sure
# brew "hledger-ui"
# brew "apple-gcc42"
# brew "asciidoc"
# brew "autoconf"
# brew "automake"
# brew "aws-shell"
# brew "bison"
# brew "c-ares"
# brew "cairo"
# brew "cloog"
# brew "cmake"
# brew "coreutils"
# brew "csvprintf"
# brew "ctags"
# brew "dbus"
# brew "dirmngr"
# brew "dnsmasq"
# brew "docbook"
# brew "docker"
# brew "dos2unix"
# brew "ec2-api-tools"
# brew "enca"
# brew "expat"
# brew "faac"
# brew "ffmpeg"
# brew "fish"
# brew "flac"
# brew "fontconfig"
# brew "fping"
# brew "fpp"
# brew "freetds"
# brew "freetype"
# brew "fribidi"
# brew "geoip"
# brew "gettext"
# brew "gitup"
# brew "glew"
# brew "glib"
# brew "gnu-getopt"
# brew "gnu-typist"
# brew "gnupg"
# brew "gnutls"
# brew "go"
# brew "gobject-introspection"
# brew "gource"
# brew "gpg-agent"
# brew "gradle"
# brew "graphviz"
# brew "groovy"
# brew "groovyserv"
# brew "haproxy"
# brew "harfbuzz"
# brew "hub"
# brew "icu4c"
# brew "iftop"
# brew "intltool"
# brew "isl"
# brew "jpeg"
# brew "kops"
# brew "kubernetes-cli"
# brew "lame"
# brew "ledger"
# brew "leptonica"
# brew "lftp"
# brew "libass"
# brew "libassuan"
# brew "libdvdcss"
# brew "libevent"
# brew "libffi"
# brew "libgcrypt"
# brew "libgpg-error"
# brew "libksba"
# brew "libmpc"
# brew "libogg"
# brew "libpng"
# brew "libssh2"
# brew "libtasn1"
# brew "libtiff"
# brew "libtool"
# brew "libusb"
# brew "libusb-compat"
# brew "libvo-aacenc"
# brew "libvorbis"
# brew "libvpx"
# brew "libxml2"
# brew "linode/cli/linode-cli"
# brew "lzo"
# brew "makedepend"
# brew "maven"
# brew "midnight-commander"
# brew "mobile-shell"
# brew "mtr"
# brew "ncurses"
# brew "nettle"
# brew "nginx"
# brew "ngrep"
# brew "nmap"
# brew "node"
# brew "oniguruma"
# brew "opencore-amr"
# brew "openvpn"
# brew "ossp-uuid"
# brew "pango"
# brew "pass"
# brew "pcre"
# brew "perl"
# brew "phantomjs"
# brew "pidof"
# brew "pinentry"
# brew "pixman"
# brew "postgresql@9.4"
# brew "proctools"
# brew "psgrep"
# brew "psqlodbc"
# brew "pth"
# brew "putty"
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "qrencode"
# brew "qt"
# brew "qt@5.5"
# brew "rabbitmq"
# brew "rdesktop"
# brew "rds-command-line-tools"
# brew "reattach-to-user-namespace"
# brew "recode"
# brew "redshift"
# brew "rrdtool"
# brew "rtmpdump"
# brew "s-lang"
# brew "s3cmd"
# brew "sdl2"
# brew "sdl2_image"
# brew "socat"
# brew "speedtest-cli"
# brew "stern"
# brew "tesseract"
# brew "theora"
# brew "tinyproxy"
# brew "tomcat"
# brew "unixodbc"
# brew "unrar"
# brew "v8@3.15"
# brew "watch"
# brew "webp"
# brew "wget"
# brew "wireshark"
# brew "wxmac"
# brew "x264"
# brew "xvid"
# brew "xz"
# brew "yasm"
# brew "zlib"

# Probably redundant
# brew "ant"
# brew "dash"
